tutorials/extraTurbulenceModels/kOmegaSSTsust/alpha12/potentialFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     potentialFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5000;

deltaT          1;

writeControl    timeStep;

writeInterval   250;

purgeWrite      1;

writeFormat     ascii;

writePrecision  10;

writeCompression compressed;

timeFormat      general;

timePrecision   10;

runTimeModifiable true;

functions //To extract the coefficients during the simulation
{
    forceCoeffs
    {
        type forceCoeffs;
        functionObjectLibs ("libforces.so");
        patches (wingtop wingbottom flapbottom flaptop flapback);
        log true
        pName p;          //pressure
        Uname U;          //velocity
        rhoName rhoInf;   //reference density name
        rhoInf 1.225;      //reference density value
        magUInf 60.8276;   //reference velocity
        CofR (0.25 0 0.5);   //Centre of rotation
        liftDir (0 1 0);   //Direction of the lift coefficient
        dragDir (1 0 0);   //Direction of the drag coefficient
        pitchAxis (0 0 1); //Pitching moment axis
        lRef 1;
        Aref 1;

        outputControl   timeStep;
        outputInterval 1;
    }
}

// ************************************************************************* //
